---
kind: other
id: Properties.T:Autodesk.Revit.DB.ConnectorElement
source: html/8d9640d7-ac12-2cc2-3b5f-2caa39e4a6cd.htm
---
# ConnectorElement Properties

The id of the assembly instance to which the element belongs.